Tekla Open API Reference for Tekla Structures 2025
Enum<E> Methods
The Enum<E> generic type exposes the following members.
Methods
Name | Description
GetSchema
ReadXml
WriteXml
Top
See Also
Reference
Enum<E> Structure
Tekla.Structures.Datatype Namespace